package com.company.С;

public class Answers {
//  1. Как вы понимаете исключения(exception)?

//  Ответ: Возникновение ошибок и непредвиденных ситуаций при выполнении программы
//____________________________________________________________________________________________________________________//
//  2. Какие исключения вы встречали?

//  Ответ: Деление на 0, выход за пределы массива, null point.
//____________________________________________________________________________________________________________________//
//  3. Что вы знаете о классе Exception

//  Ответ: У него есть дочерныие классы unchecked exceptions и checked exceptions.
//         У класса есть методы: getMessage(), getStackTrace(), printStackTrace().
//____________________________________________________________________________________________________________________//
//  4. Что будет если не обработать исключение?

//  Ответ: Программа не скомпилируется, программа остановиться.
//____________________________________________________________________________________________________________________//
//  5. Объясните, как работает структура try-catch

//  Ответ: try ловит исключение, catch обрабатывает это исключение.
//____________________________________________________________________________________________________________________//
}
