package org.example;

public class Answers {

//    1) Привести примеры из реальной жизни следующих видов связи:
//       OneToOne, ManyToOne, OneToMany и ManyToOne

//    Ответ: OneToOne - 1 человек 1 паспорт, ManyToOne - у многих спортсменов один вид спорта,
//           OneToMany - в одной стране много городов, ManyToMany - разные автобусы могут водить разные водители.
//______________________________________________________________________________________________________________________
//    2) Что такое Jpa?

//    Ответ: JPA (Java Persistence API) — программный интерфейс API.
//           Способ сохранения java объектов в базы данных.
//______________________________________________________________________________________________________________________
//    3) Что такое ORM и Hibernate?

//    Ответ: ORM - это технология, которая связывает базы данных с концепциями ООП.
//           Hibernate - это технология реализации интерфейса Jpa
}
