package com.company.C;

public class Answers {
//     1. Что вам непонятно в массивах?

//     Ответ: При создании числового массива если не заполнить массив, то он автоматически заролнятеся нулем.
//            Вот тут мне не понятно почему не null??
//            Ноль это тоже число. Возникнет конфилкт если мы хотим найти пустую ячейку.
//____________________________________________________________________________________________________________________//
//     2. Какие минусы есть у ArrayList

//     Ответ:  При вставке или удалении элемента в середине будет перезапись элементов.
//____________________________________________________________________________________________________________________//
//     3. Объясните структуру LinkedList?

//     Ответ: Реализация основана на двусвязном списке.
//            Каждый элемент структуры содержит указатели на предыдущий и следующий элементы.
//____________________________________________________________________________________________________________________//
//     4. В чем отличие между ArrayList и LinkedList?

//     Ответ: ArrayList обеспечивает произвольный доступ к элементам в списке.
//            LinkedList не разрешает произвольный доступ к элементам в списке.
//____________________________________________________________________________________________________________________//
//     5. Какие плюсы и минусы есть при работе с LinkedList?

//     Ответ: Плюсы -> При добавление и удалении список не презаписывается.
//            Минусы -> Обращение к элементам по индексу в списке медленнее.
//____________________________________________________________________________________________________________________//
}
