package com.company.C;

public class Answers {
//     1. Как вы понимаете массивы?

//     Ответ: Это ссылочный тип данных. Можно представить как ящик с ячейками.
//____________________________________________________________________________________________________________________//
//     2. Как вы понимаете ArrayList?

//     Ответ: ArrayList – это список, который очень похож на массив . Можно представить как резиновый массив.
//____________________________________________________________________________________________________________________//
//     3. В чем отличия между обычным массивом и ArrayList?

//     Ответ: Обычный массив ограничиный размер а ArrayList размер по факту.
//____________________________________________________________________________________________________________________//
//     4. Как вы понимаете Wrapper классы и для чего они нужны?

//     Ответ: Это специальный класс, который хранит внутри себя значение примитива.
//            Для использования примитивных значений везде, где разрешены только объекты.
//____________________________________________________________________________________________________________________//
//     5. Чем отличаются методы set(a, b) и add(a, b) у ArrayList?

//     Ответ: set(a, b) заменяет | add(a, b) добавляет.
//____________________________________________________________________________________________________________________//
}
