package com.company.B;

public class Answers {
//     1. Что такое строка?

//     Ответ: Это последовательность символов. Для создания строк Java предоставляет класс String.
//            Объекты класса String являются неизменяемыми.
//            Когда мы изменяем строку, то на самом деле создаётся новая строка.
//____________________________________________________________________________________________________________________//
//     2. Что делает функция split у строк?

//     Ответ: Возвращяет массив строк. Разделяет строку по символам.
//____________________________________________________________________________________________________________________//
//     3. Что делает функция indexOf?

//     Ответ: Возвращает индекс символа или строки.
//____________________________________________________________________________________________________________________//
//     4. Что делает функция substring?

//     Ответ: Получает часть строки, с заданным диапозоном индексов. Как то так понял...
//____________________________________________________________________________________________________________________//
}
