package com.company.C;

public class Answers  {

//    1. Суть модификатора final - сделать дальнейшее изменение объекта невозможным.
//       Он нужен если мы не хотим что бы поле или метод изменяли:)
//       Например у нас свойство число пи. Тут и мы постваим final

//    2. Переменные, методы и классы

//    3. Для переменной что бы сделать константой, для метода что бы запретить переопределение метода в дочерних классах
//       Для класса что бы класс не наследовался.

//    4. Это визитка с адрессом по которой можно обратикся к обьекту.

//    5. При выполнении операции присвоения к  ссылочным переменным  копируются адреса,  а не сами данные.
//       При выполнении операции присвоения к примитивным переменны  копируются данные из одной ячейки памяти в другую.
}
