package com.company.B;

public class Answers {
    // 1) Модификаторы доступа дает нам возможность установить уровень доступа к переменной или к методу.
    //    Нужны для защиты изменения данных. Инкапсуляциядегендей :З

    // 2) default, public, private, protected

    // 3) Package это объединение классов. Если есть одинавковые названия классов можно их разделить по пакетам.

    // 4) default доступ внутри текущего пакета, public хоть на мерсе:)

    // 5) private сеттер, смысла не вижу если чесснаааа xD
}
