package com.company;

public class Main {

    public static void main(String[] args) {
	    // 1) ООП представляет программу как набор объектов и их взаимодействий.

        // 2) Класс — это шаблон для создания объекта. 

        // 3) Свойства — это любые данные, которыми можно характеризовать объект класса.

        // 4) Как создать экземпляр класса (объект)?
        //    Person person1 = new Person();
        //    Person person2 = new Person();

        // 5) Как создать свойства для определенного класса?
        //    public class Person {
        //        String name;
        //        int age;
        // }

        // 6) Как задать свойства?
        //   К примеру в мейне:
        //   person1.name = "Chika";
        //   person2.name = "Chuhuka";
        //   person1.age = 28;
        //   person2.age = 18;

        // 7) Как получить определенное свойства объекта?
        //    System.out.println(person1.name + " " + person2.name);

        // Если честно я не совсем поянл суть вопроса задать, создать и получить.
        // А так я поянл конечно как создавать классы, создавать объкты класса, задавать им свойства и как их в мейне получать. Вот только вопросы не поял :(
    }
}
