package com.company.B;

class Answers {

//    Что для вас поток?

//    Ответ: Последовательность инструкций, которые выполняются параллельно с другими потоками.
//----------------------------------------------------------------------------------------------------------------------
//    Как вы понимаете многопоточное программирование?

//    Ответ: При помощи многопоточности мы можем выделить в приложении несколько потоков,
//           которые будут выполнять различные задачи одновременно.
//----------------------------------------------------------------------------------------------------------------------
//    Для чего по-вашему нам нужны потоки?

//    Ответ: Например при скачивании или загрузки файла параллельно обрабатывая графическую часть,
//           типо анимацию (процент загрузки) и с возможностью остановить или сделать паузу загрузки.
//----------------------------------------------------------------------------------------------------------------------
//    Представьте себе, что люди работают параллельно над одной задачей, какие проблемы могут всплыть из-за этого?

//    Ответ: Разные результаты нАвернА.
//----------------------------------------------------------------------------------------------------------------------
//    Что такое synchronized?

//    Ответ: Как я понял, делает ограничение потоку если другой поток уже обрабатывает это же метод или часть кода.
//----------------------------------------------------------------------------------------------------------------------
}