package com.company.B;

public class Answers {
//    Для чего нужны Generics?

//    Ответ: 1) Компилятор может выполнять проверки кода во время компиляции на предмет безопасности типов
//           2) Позволяет писать код, который применим ко многим типам с одинаковым базовым поведением
//           3) он позволяет избежать упаковки / распаковки, либо преобразования объектов в требуемый ссылочный тип
//______________________________________________________________________________________________________________________
//    Примеры Generic классов в Java?

//    Ответ: ArrayList, HashSet, HashMap и т.п.
//______________________________________________________________________________________________________________________
//    Почему плохо создавать поля так: Object value; нежели T value?

//    Ответ: Нужно все время кастить или делать проверку
//______________________________________________________________________________________________________________________
}
