package com.company.B;

public class Answers {
//    Разница между потоком и процессом?

//    Ответ: Процесс - это выполнение программы
//           Поток - это выполнение программы, использующее ресурсы процесса для выполнения задачи
//______________________________________________________________________________________________________________________
//    Какие есть состояния потока?

//    Ответ: New, Runnable, Running, Waiting, Blocked, Sleeping, Dead
//______________________________________________________________________________________________________________________
//    Зачем isAlive()?

//    Ответ: Узнать поток запущен или нет. Возвращает true или false
//______________________________________________________________________________________________________________________
//    Зачем join()?

//    Ответ: Для очередности потоков
//______________________________________________________________________________________________________________________
//    Что будет если вызвать new MyThread().run() напрямую без вызова start()?

//    Ответ: Отработает как обычный метод
//______________________________________________________________________________________________________________________
//    Можно ли запустить один поток дважды?

//    Ответ: Нет
//______________________________________________________________________________________________________________________
//    Что такое блок синхронизации?

//    Ответ: Как я понял он блокирует один поток пока другой поток не завершит действие с этим блоком.
//______________________________________________________________________________________________________________________
}
