package com.company.B;

public class Answers {
//    1. Что такое Enum?

//    Отввет: Список именованных констант. Он может иметь конструкторы, методы и переменные экземпляра.
//____________________________________________________________________________________________________________________//
//    2. Приведите 3 примера где можно было бы использовать Enum?

//    Отввет: Дни недели, месяца года, сезоны года.
//____________________________________________________________________________________________________________________//
//    3. Какие плюсы использования Enum вы знаете?

//    Отввет: Безопасноть , красивый и короткий код, использование оператора Switch.
//____________________________________________________________________________________________________________________//
//    4. Когда лучше использовать LinkedList, ArrayList и обычный Array?

//    Отввет: LinkedList при добавлении , ArrayList при считвании,
//    Array если размер фиксирован(например массив из месяцев, размер будет 12 так как количество мсяцев константа).
//____________________________________________________________________________________________________________________//
//    5. Напишите кодом любой пример из 2. Пункта используя switch case

//    Отввет: MonthsOfTheYear monthsOfTheYear = MonthsOfTheYear.valueOf("APRIL");
//            switch (monthsOfTheYear) {
//                case JANUARY -> System.out.println("Зимний месяц");
//                case AUGUST -> System.out.println("Летний месяц");
//                case SEPTEMBER -> System.out.println("Осений месяц");
//                case APRIL -> System.out.println("Весений месяц");
//            }
//____________________________________________________________________________________________________________________//
}
