package com.company.B;

public class Answers {
//    1. Как вы понимаете hashCode?

//    Отввет: Это целое число int. Номер ячейки памяти, где хранится обьект.
//____________________________________________________________________________________________________________________//
//    2. Для чего мы можем переписать метод генерирования hashCode?

//    Отввет: Что бы минимализировать коллизию
//____________________________________________________________________________________________________________________//
//    3. Как работает HashSet?

//    Отввет: Хранит уникальные данные по хешкоду
//____________________________________________________________________________________________________________________//
//    4. Какие отличия есть у HashSet & ArrayList?

//    Отввет: HashSet реализует Set, ArrayList реализует List. HashSet не имеет дубликатов.
//____________________________________________________________________________________________________________________//
//    5. Как вы думаете, как мы можем избавиться от дубликатов в ArrayList при помощи HashSet

//    Пример: ArrayList<String> arrayList = new ArrayList<>();
//            arrayList.add("1");
//            arrayList.add("1");
//            arrayList.add("2");
//            arrayList.add("3");
//
//            Set<String> hashSet = new HashSet<>(arrayList);
//
//            arrayList.removeAll(arrayList);
//            arrayList.addAll(hashSet);
//____________________________________________________________________________________________________________________//
}





