package com.company.taskB;

public class Answers {

//    Что такое анонимный класс?

//    Ответ: У анонимного класса имени нет и создается из интерфейса, реализуя его методы на месте.
//______________________________________________________________________________________________________________________
//    Что такое лямбда?

//    Ответ: Упрощённая запись анонимного класса, реализующего функциональный интерфейс.
//______________________________________________________________________________________________________________________
//    В чем разница между лямбдой и анонимным классом?

//    Ответ: Лямбдой реализуется только функциональный интерфейс, то есть интерфейс только с одним методом.
//           Анонимным класс может реализовать интерфейс с любым количеством абстрактных методов.
//______________________________________________________________________________________________________________________
//    Что такое функциональный интерфейс?

//    Ответ: Интерфейс только с одним абстрактным методом.
//______________________________________________________________________________________________________________________
//    Можем ли мы создать анонимный класс на основе интерфейса с более чем одним методом? Почему?

//    Ответ: Да. Потому что в коде мы явно указываем какой метод оверайдить.
//______________________________________________________________________________________________________________________
//    Можем ли мы создать лямбду на основе интерфейса с более чем одним методом? Почему?

//    Ответ: Нет. Потому что лямда реализует только функциональный интерфейс, то есть интерфейс с одним методом.
//______________________________________________________________________________________________________________________
}