package com.company.B;

public class Answers {
//   1. Как вы понимаете понятие полиморфизма?

//   Ответ: Использование одного метода для нескольких классов.
//____________________________________________________________________________________________________________________//
//   2. Что такое кастинг(cast) типов в мире программирования?

//   Ответ: Преобразование.
//____________________________________________________________________________________________________________________//
//   3. Зачем мы храним объекты типа Shark, Duck, Turtle в одном массиве?

//   Ответ: Для использование метода для всех плавающих обьектов.
//____________________________________________________________________________________________________________________//
//   4. Какие есть ограничения при хранении разных типов (Shark, Duck, Turtle и т.д.) в одном массиве (Swimmable)?

//   Ответ: Cast
//____________________________________________________________________________________________________________________//
//   5. Что произойдет после того как отработает следующая строчка кода, опишите подробнее: Person[] people;

//   Ответ : Ошибка null point.
}
