package com.company.B;

public class Answers  {
//--------------------------------------------------------------------------------------------------------------------//
//     1. Защита от внешних воздействий.
//        Инструменты: Модификаторы доступа(default, public, private, protected), геттеры и сеттеры.
//--------------------------------------------------------------------------------------------------------------------//
//     2. Возможность повторно использовать код в дочернем классе. Сокращение кода, удобство + эконмим время.
//
//     Пример 1) Есть класс Транспорт со свойствами: объем двигателя, цвет кузова, грузоподъемность и т.д.
//               Можно содздать классы Машина, Мотоцикл, Автобус, Трактор и наследовать их от класса Транспорт.

//     Пример 2) Создать классы Ferrari, Mercedes, BMW и наследовать их от класса Машина.
//--------------------------------------------------------------------------------------------------------------------//
//     3. Static это модификатор, прменяеться к свойствам и методам.
//        Статичные методы и свойства привязаны к классу а не к объекту.
//--------------------------------------------------------------------------------------------------------------------//
//     4. Пока точно еще незаню полный ответ:) Тема пока еще свежая. Но отвечу как понял.
//        Ну например у нас есть класс Лепешка, и в нем есть свойство вес и цена.
//        Нам нужно посчить всю сумму цен испеченных лепешек. Вот тут мы используем static переменную.
//--------------------------------------------------------------------------------------------------------------------//
//     5. Статичный метод наследуется.
//--------------------------------------------------------------------------------------------------------------------//
//     6. Класс.переменная(Пример: Car.countObjectCar) если переменная не private.
//        Если private то через public static метод.
//--------------------------------------------------------------------------------------------------------------------//
//     7. Ставим модификатор private и считываем через public static метод.
//--------------------------------------------------------------------------------------------------------------------//
}
