package com.company.B;

public class Answers {
// 1) Что такое модификатор abstract и зачем он нам?

// Ответ: Abstract — используется для создания абстрактных классов и методов. Нужен для наследования конкретных обьктов.
//____________________________________________________________________________________________________________________//
// 2) К каким элементам можно применять abstract?

// Ответ: К классам и методам.
//____________________________________________________________________________________________________________________//
// 3) Объясните применение abstract для методов.

//    Ответ: Как я понял, abstract методы это дефолтные действия присуще к объекту.
//           По сути это шаблон для создания метода.
//    Например: Абстрактный класс животные. Все животные спят и кушают. Но все живтоные по разному спят и кушают.
//____________________________________________________________________________________________________________________//
// 4) Приведите примеры реального мира, которые теоретически следовало бы создать abstract в мире ООП.

//    Пример: Сим карта, помещение, птица, рыба.
//____________________________________________________________________________________________________________________//
// 5) Объясните применение abstract для классов.

//    Ответ: Abstract class не имеет тела и он нужен только для наследования! Это вот так я понял.
//____________________________________________________________________________________________________________________//
}
