package com.company.B;

public class Answers {

//    1. Что такое interface?

//       Это совокупность абстрактных методов.
//       Класс реализует интерфейс, таким образом наследуя абстрактные методы интерфейса.
//--------------------------------------------------------------------------------------------------------------------//
//    2. В чем отличие interface от обычного класса?

//       Ответ:
//       В интерфейсе не содержатся конструкторы.
//       Интерфейс не расширяется классом, он реализуется классом.
//--------------------------------------------------------------------------------------------------------------------//
//    3. Объясните применение interface.

//       Ответ:
//       Полиморфизм.Способность выполнять одну и ту же операцию над несколькими различными объектами.
//--------------------------------------------------------------------------------------------------------------------//
//    4. Отличие interface от abstract класса?

//       Ответ:
//       interface не имеет переменных. Ни один метод не реализован, все они публичные.
//       Abstract имеет переменные. Не реализован оди или больше методов.
//--------------------------------------------------------------------------------------------------------------------//
//    5. Что такое ссылка?

//       Ответ:
//       Ссылка — это переменная, содержащая адрес ячейки памяти, в которой хранится объект.
//--------------------------------------------------------------------------------------------------------------------//
//    6. Как можно использовать ссылку типа родительского класса для других объектов типа наследник?

//       Ответ:
//       К примеру --> class Person extends Human{}
//       Human human1 = new Person();                                             Вопрос если чеснА не понял нормально:)
//--------------------------------------------------------------------------------------------------------------------//
}
