package com.company.B;

public class Answers {
//    1. Что такое интерфейс?

//    Ответ: Интерфейс - это совокупность абстрактных методов!
//           Интерфейсы - это один из механизмов реализации принципа полиморфизма (один интерфейс, несколько методов).
//____________________________________________________________________________________________________________________//
//    2. В чем преимущество использования интерфейсов?

//    Ответ: Множественное наследование
//____________________________________________________________________________________________________________________//
//    3. Как работают свойства в интерфейсах?

//    Ответ: public static final
//____________________________________________________________________________________________________________________//
//    4. Может ли один интерфейс унаследовать другой?

//    Ответ: Да может! (interface B extends A)
//____________________________________________________________________________________________________________________//
//    5. Что такое композиция?

//    Ответ: Повторное использование кода
//    Пример: Есть класс Person и класс Job. Person иммеет класс Job xD как бы это пошло не звучало :З
//____________________________________________________________________________________________________________________//
//    6. Что такое наследование?

//    Ответ: Наследование — это когда класс-наследник имеет все поля и методы родительского класса.
//____________________________________________________________________________________________________________________//
//    7. В чем отличие между наследованием и композицией?

//    Ответ: При композиции мы можем повторно использовать код даже из final-класса,
//           тогда как унаследоваться от него невозможно.
//           А так вообще это разные вещи! Не стоит их сравнивать я так считаю:)
}
